In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('adult.data.csv')

In [3]:
df

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32557,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32558,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32559,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
32560,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

# Q1. Print first 5 rows

In [4]:
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

# Q2.How many men and women (sex feature) are represented in this dataset?

In [9]:
df['sex'].value_counts()

Male      21790
Female    10771
Name: sex, dtype: int64

In [28]:
df.groupby('sex')['sex'].count()

sex
Female    10771
Male      21790
Name: sex, dtype: int64

# Q3.What is the average age (age feature) of women?

In [44]:
df[df['sex'] == 'Female']['age'].mean()

36.85823043357163

In [34]:
female=df[df['sex']=='Female']

In [37]:
len(female)

10771

In [38]:
female.describe()     #average age of female is 36.858230 years

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
count,10771.000000,1.077100e+04,10771.000000,10771.000000,10771.000000,10771.000000
mean,36.858230,1.857463e+05,10.035744,568.410547,61.187633,36.410361
std,14.013697,1.029861e+05,2.379954,4924.262944,340.907518,11.811300
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,25.000000,1.173630e+05,9.000000,0.000000,0.000000,30.000000
50%,35.000000,1.760770e+05,10.000000,0.000000,0.000000,40.000000
75%,46.000000,2.283315e+05,12.000000,0.000000,0.000000,40.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

# Q4. What is the proportion of German citizens (native-country feature)?

In [45]:
(df['native-country'] == 'Germany').mean()

0.004207487485028101

# Q5.What are mean value and standard deviation of the age of those who recieve more than 50K per year (salary* feature) and those who receive less than 50K per year? **

In [49]:
mean_greater_than_50K=df[df['salary'] == '>50K']['age'].mean()

In [65]:
# mean of the age who receives more than 50k salary is as below 44.24
mean_greater_than_50K

44.24984058155847

In [63]:
# standard deviation of the age who receives more than 50k salary is as below 10.5190
df[df['salary'] == '>50K']['age'].std()

10.51902771985177

In [59]:
# mean of the age who receives less than 50k salary is as below 44.24
mean_less_than_50k=df[df['salary'] == '<=50k']['age'].mean()

In [60]:
mean_less_than_50K

44.24984058155847

In [67]:
# standard deviation of the age who receives less than 50k salary is as below 14.02
df[df['salary'] == '<=50K']['age'].std()

14.020088490824813

# Q6. Is it true that people who receive more than 50k have at least high school education? (education - Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters or Doctorate feature)

In [69]:
df[df['salary'] == '>50K']['education'].unique()

array(['HS-grad', 'Masters', 'Bachelors', 'Some-college', 'Assoc-voc',
       'Doctorate', 'Prof-school', 'Assoc-acdm', '7th-8th', '12th',
       '10th', '11th', '9th', '5th-6th', '1st-4th'], dtype=object)

# Q7.Display statistics of age for each race (race feature) and each gender. Use groupby() and describe(). Find the maximum age of men of Amer-Indian-Eskimo race.

In [70]:
df.groupby(['race', 'sex'])['age'].describe()

                             count       mean        std   min   25%   50%  \
race               sex
Amer-Indian-Eskimo Female    119.0  37.117647  13.114991  17.0  27.0  36.0
                   Male      192.0  37.208333  12.049563  17.0  28.0  35.0
Asian-Pac-Islander Female    346.0  35.089595  12.300845  17.0  25.0  33.0
                   Male      693.0  39.073593  12.883944  18.0  29.0  37.0
Black              Female   1555.0  37.854019  12.637197  17.0  28.0  37.0
                   Male     1569.0  37.682600  12.882612  17.0  27.0  36.0
Other              Female    109.0  31.678899  11.631599  17.0  23.0  29.0
                   Male      162.0  34.654321  11.355531  17.0  26.0  32.0
White              Female   8642.0  36.811618  14.329093  17.0  25.0  35.0
                   Male    19174.0  39.652498  13.436029  17.0  29.0  38.0

                             75%   max
race               sex
Amer-Indian-Eskimo Female  46.00  80.0
                   Male    45.00  82.0
Asian-Pac-Islander Female  43.75  75.0
                   Male    46.00  90.0
Black              Female  46.00  90.0
                   Male    46.00  90.0
Other              Female  39.00  74.0
                   Male    42.00  77.0
White              Female  46.00  90.0
                   Male    49.00  90.0

In [71]:
# the maximum age of men of Amer-Indian-Eskimo race is
df[(df['race'] == 'Amer-Indian-Eskimo') & (df['sex'] == 'Male')]['age'].max()

82

# Q8.Among whom the proportion of those who earn a lot(>50K) is more: among married or single men (marital-status feature)? Consider married those who have a marital-status starting with Married (Married-civ-spouse, Married-spouse-absent or Married-AF-spouse), the rest are considered bachelors.

In [72]:
married = df[df['marital-status'].str.startswith('Married')]
single = df[~df['marital-status'].str.startswith('Married')]

In [75]:
married.head(2)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K

In [76]:
single.head(2)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K

In [77]:
(married['salary'] == '>50K').mean()

0.43692028280469614

In [78]:
(single['salary'] == '>50K').mean()

0.0644540363975735

# Q9. What is the maximum number of hours a person works per week (hours-per-week feature)? How many people work such a number of hours and what is the percentage of those who earn a lot among them?

In [79]:
max_hours = df['hours-per-week'].max()
num_max_hours = (df['hours-per-week'] == max_hours).sum()

In [80]:
max_hours

99

In [81]:
num_max_hours

85

In [95]:
max_hours_per_week = df["hours-per-week"].max()
max_hours_workers = df[df["hours-per-week"] == max_hours_per_week]
num_max_hours_workers = len(max_hours_workers)
rich_max_hours_workers = max_hours_workers[max_hours_workers["salary"] == ">50K"]
num_rich_max_hours_workers = len(rich_max_hours_workers)

In [96]:
max_hours_per_week

99

In [98]:
max_hours_workers.head(2)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
935,37,Private,176900,HS-grad,9,Married-civ-spouse,Craft-repair,Husband,White,Male,0,0,99,United-States,>50K
1172,25,Private,404616,Masters,14,Married-civ-spouse,Farming-fishing,Not-in-family,White,Male,0,0,99,United-States,>50K

In [99]:
num_max_hours_workers

85

In [101]:
rich_max_hours_workers.head(2)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
935,37,Private,176900,HS-grad,9,Married-civ-spouse,Craft-repair,Husband,White,Male,0,0,99,United-States,>50K
1172,25,Private,404616,Masters,14,Married-civ-spouse,Farming-fishing,Not-in-family,White,Male,0,0,99,United-States,>50K

In [102]:
num_rich_max_hours_workers

25

# Q10. Count the average time of work (hours-per-week) those who earning a little and a lot (salary) for each country (native-country).

In [103]:
grouped = df.groupby(["native-country", "salary"])

for name, group in grouped:
    country = name[0]
    salary = name[1]
    avg_hours_per_week = group["hours-per-week"].mean()
    print("For", country, "and", salary, "workers, the average time of work is:", avg_hours_per_week)

For ? and <=50K workers, the average time of work is: 40.16475972540046
For ? and >50K workers, the average time of work is: 45.54794520547945
For Cambodia and <=50K workers, the average time of work is: 41.416666666666664
For Cambodia and >50K workers, the average time of work is: 40.0
For Canada and <=50K workers, the average time of work is: 37.91463414634146
For Canada and >50K workers, the average time of work is: 45.64102564102564
For China and <=50K workers, the average time of work is: 37.38181818181818
For China and >50K workers, the average time of work is: 38.9
For Columbia and <=50K workers, the average time of work is: 38.68421052631579
For Columbia and >50K workers, the average time of work is: 50.0
For Cuba and <=50K workers, the average time of work is: 37.98571428571429
For Cuba and >50K workers, the average time of work is: 42.44
For Dominican-Republic and <=50K workers, the average time of work is: 42.338235294117645
For Dominican-Republic and >50K workers, the average time of work is: 47.0
For Ecuador and <=50K workers, the average time of work is: 38.041666666666664
For Ecuador and >50K workers, the average time of work is: 48.75
For El-Salvador and <=50K workers, the average time of work is: 36.03092783505155
For El-Salvador and >50K workers, the average time of work is: 45.0
For England and <=50K workers, the average time of work is: 40.483333333333334
For England and >50K workers, the average time of work is: 44.53333333333333
For France and <=50K workers, the average time of work is: 41.05882352941177
For France and >50K workers, the average time of work is: 50.75
For Germany and <=50K workers, the average time of work is: 39.13978494623656
For Germany and >50K workers, the average time of work is: 44.97727272727273
For Greece and <=50K workers, the average time of work is: 41.80952380952381
For Greece and >50K workers, the average time of work is: 50.625
For Guatemala and <=50K workers, the average time of work is: 39.36065573770492
For Guatemala and >50K workers, the average time of work is: 36.666666666666664
For Haiti and <=50K workers, the average time of work is: 36.325
For Haiti and >50K workers, the average time of work is: 42.75
For Holand-Netherlands and <=50K workers, the average time of work is: 40.0
For Honduras and <=50K workers, the average time of work is: 34.333333333333336
For Honduras and >50K workers, the average time of work is: 60.0
For Hong and <=50K workers, the average time of work is: 39.142857142857146
For Hong and >50K workers, the average time of work is: 45.0
For Hungary and <=50K workers, the average time of work is: 31.3
For Hungary and >50K workers, the average time of work is: 50.0
For India and <=50K workers, the average time of work is: 38.233333333333334
For India and >50K workers, the average time of work is: 46.475
For Iran and <=50K workers, the average time of work is: 41.44
For Iran and >50K workers, the average time of work is: 47.5
For Ireland and <=50K workers, the average time of work is: 40.94736842105263
For Ireland and >50K workers, the average time of work is: 48.0
For Italy and <=50K workers, the average time of work is: 39.625
For Italy and >50K workers, the average time of work is: 45.4
For Jamaica and <=50K workers, the average time of work is: 38.23943661971831
For Jamaica and >50K workers, the average time of work is: 41.1
For Japan and <=50K workers, the average time of work is: 41.0
For Japan and >50K workers, the average time of work is: 47.958333333333336
For Laos and <=50K workers, the average time of work is: 40.375
For Laos and >50K workers, the average time of work is: 40.0
For Mexico and <=50K workers, the average time of work is: 40.00327868852459
For Mexico and >50K workers, the average time of work is: 46.57575757575758
For Nicaragua and <=50K workers, the average time of work is: 36.09375
For Nicaragua and >50K workers, the average time of work is: 37.5
For Outlying-US(Guam-USVI-etc) and <=50K workers, the average time of work is: 41.857142857142854
For Peru and <=50K workers, the average time of work is: 35.06896551724138
For Peru and >50K workers, the average time of work is: 40.0
For Philippines and <=50K workers, the average time of work is: 38.065693430656935
For Philippines and >50K workers, the average time of work is: 43.032786885245905
For Poland and <=50K workers, the average time of work is: 38.166666666666664
For Poland and >50K workers, the average time of work is: 39.0
For Portugal and <=50K workers, the average time of work is: 41.93939393939394
For Portugal and >50K workers, the average time of work is: 41.5
For Puerto-Rico and <=50K workers, the average time of work is: 38.470588235294116
For Puerto-Rico and >50K workers, the average time of work is: 39.416666666666664
For Scotland and <=50K workers, the average time of work is: 39.44444444444444
For Scotland and >50K workers, the average time of work is: 46.666666666666664
For South and <=50K workers, the average time of work is: 40.15625
For South and >50K workers, the average time of work is: 51.4375
For Taiwan and <=50K workers, the average time of work is: 33.774193548387096
For Taiwan and >50K workers, the average time of work is: 46.8
For Thailand and <=50K workers, the average time of work is: 42.86666666666667
For Thailand and >50K workers, the average time of work is: 58.333333333333336
For Trinadad&Tobago and <=50K workers, the average time of work is: 37.05882352941177
For Trinadad&Tobago and >50K workers, the average time of work is: 40.0
For United-States and <=50K workers, the average time of work is: 38.79912723305605
For United-States and >50K workers, the average time of work is: 45.50536884674383
For Vietnam and <=50K workers, the average time of work is: 37.193548387096776
For Vietnam and >50K workers, the average time of work is: 39.2
For Yugoslavia and <=50K workers, the average time of work is: 41.6
For Yugoslavia and >50K workers, the average time of work is: 49.5